Repository: BravoBaldo/Translations
Catalog: GoogleTest/GoogleTest_OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: it_it

source: Floating-Point Predicate-Format Functions
it_it: Predicato in Virgola Mobile-Funzioni di Formattazione

source: For example,
it_it: Per esempio,

source: For example, if you define IsEven() as:
it_it: Per esempio, se si definisce IsEven() come:

source: For example, the following test will segfault:
it_it: Per esempio, il seguente test genererà un segfault:

source: For example, you can rewrite T2 Foo(T1 x) to void Foo(T1 x, T2* result).
it_it: Per esempio, si può riscrivere T2 Foo(T1 x) in void Foo(T1 x, T2* result).

source: For example:
it_it: Per esempio:

source: For instance,
it_it: Per esempio,

source: For MSVC, the equivalent would be --cxxopt=/std:c++14.
it_it: Per MSVC, l'equivalente sarebbe --cxxopt=/std:c++14.

source: For MSVC, the equivalent would be `--cxxopt=/std:c++14`.
it_it: Per MSVC, l'equivalente sarebbe `--cxxopt=/std:c++14`.

source: For a complete example using derived test fixtures, see sample5_unittest.cc.
it_it: Per un esempio completo sull'uso delle fixture derivate, vedere sample5_unittest.cc.

source: For a complete example using derived test fixtures, see [sample5_unittest.cc](https://github.com/google/googletest/blob/main/googletest/samples/sample5_unittest.cc).
it_it: Per un esempio completo sull'uso delle test fixture derivate, vedere [sample5_unittest.cc](https://github.com/google/googletest/blob/main/googletest/samples/sample5_unittest.cc).

source: For a more comprehensive guide to also including ${CHOST} in build system calls, see the excellent tutorial by Diego Elio Pettenò:
it_it: Per una guida più completa su come includere anche ${CHOST} nelle chiamate di sistema della build, vedere l'eccellente tutorial di Diego Elio Pettenò:

source: For a more comprehensive guide to also including `${CHOST}` in build system calls, see the excellent tutorial by Diego Elio Pettenò: <https://autotools.io/pkgconfig/cross-compiling.html>
it_it: Per una guida più completa su come includere anche `${CHOST}` nelle chiamate di sistema della build, vedere l'eccellente tutorial di Diego Elio Pettenò: <https://autotools.io/pkgconfig/cross-compiling.html>

source: For advanced Google C++ Testing Framework topics, check out the Google TestAdvancedGuide.
it_it: Per argomenti avanzati sul framework di test di Google C++, consultare la Google TestAdvancedGuide.

source: For advanced developers, I recommend you read some of the other articles about open regression frameworks such as the Boost unit test framework and CppUnit.
it_it: Per gli sviluppatori avanzati, consiglio di leggere alcuni degli altri articoli sui framework di regressione aperti come il framework delle unit test Boost e CppUnit.

source: For all examples here we assume you want to compile the sample samples/sample3_unittest.cc.
it_it: Per tutti gli esempi qui assumiamo che si voglia compilare l'esempio samples/sample3_unittest.cc.

source: For all examples here we assume you want to compile the sample `samples/sample3_unittest.cc`.
it_it: Per tutti gli esempi qui assumiamo che si voglia compilare l'esempio `samples/sample3_unittest.cc`.

source: For better readability, gMock also gives you:
it_it: Per una migliore leggibilità, gMock offre anche:

source: For const methods the 4th parameter becomes (const, override), for non-const methods just (override).
it_it: Per i metodi const il 4° parametro diventa (const, override), per i metodi non-const basta (override).

source: For const methods the 4th parameter becomes `(const, override)`, for non-const methods just `(override)`.
it_it: Per i metodi const il 4° parametro diventa `(const, override)`, per i metodi non-const basta `(override)`.

source: For containers that define a size() method, SizeIs(m) may be more efficient.
it_it: Per i contenitori che definiscono un metodo size(), SizeIs(m) potrebbe essere più efficiente.

source: For containers that define a `size()` method, `SizeIs(m)` may be more efficient.
it_it: Per i contenitori che definiscono un metodo `size()`, `SizeIs(m)` potrebbe essere più efficiente.

source: For context, see Death Tests.
it_it: Per il contesto, consultare I Death Test.

source: For context, see [Death Tests](../advanced.md#death-tests).
it_it: Per il contesto, consultare [I Death Test](../advanced.md#death-tests).

source: For convenience, the filter '*-NegativePatterns' can be also written as '-NegativePatterns'.
it_it: Per comodità, il filtro '*-NegativePatterns' può anche essere scritto come '-NegativePatterns'.

source: For convenience, the filter `'*-NegativePatterns'` can be also written as `'-NegativePatterns'`.
it_it: Per comodità, il filtro `'*-NegativePatterns'` può anche essere scritto come `'-NegativePatterns'`.

source: For convenience, we allow the description string to be empty (""), in which case gMock will use the sequence of words in the matcher name as the description.
it_it: Per comodità, supponiamo che la stringa della descrizione sia vuota (""), nel qual caso gMock utilizzerà la sequenza di parole nel nome del matcher come descrizione.

source: For convenience, we allow the description string to be empty (`""`), in which case gMock will use the sequence of words in the matcher name as the description.
it_it: Per comodità, supponiamo che la stringa della descrizione sia vuota (`""`), nel qual caso gMock utilizzerà la sequenza di parole nel nome del matcher come descrizione.

source: For convenience, we use the term *arguments* for the values used to invoke the mock function, and the term *parameters* for the values used to instantiate an action.
it_it: Per comodità, utilizziamo il termine *argomenti* per i valori utilizzati per invocare la funzione mock e il termine *parametri* per i valori utilizzati per istanziare un'azione.

source: For convenience, we use the term arguments for the values used to invoke the mock function, and the term parameters for the values used to instantiate an action.
it_it: Per comodità, utilizziamo il termine argomenti per i valori utilizzati per invocare la funzione mock e il termine parametri per i valori utilizzati per istanziare un'azione.

source: For convenience, you can just derive the fixture class from testing::TestWithParam<T>, which itself is derived from both testing::Test and testing::WithParamInterface<T>.
it_it: Per comodità, si può semplicemente derivare la classe fixture da testing::TestWithParam<T>, che a sua volta è derivata sia da testing::Test che da testing::WithParamInterface<T>.

source: For convenience, you can just derive the fixture class from `testing::TestWithParam<T>`, which itself is derived from both `testing::Test` and `testing::WithParamInterface<T>`.
it_it: Per comodità, si può semplicemente derivare la classe fixture da `testing::TestWithParam<T>`, che a sua volta è derivata sia da `testing::Test` che da `testing::WithParamInterface<T>`.

source: For each TEST_F, GoogleTest will create a fresh test fixture object, immediately call SetUp(), run the test body, call TearDown(), and then delete the test fixture object.
it_it: Per ciascun TEST_F, GoogleTest creerà un nuovo oggetto fixture, chiamerà immediatamente SetUp(), eseguirà il corpo del test, chiamerà TearDown() per poi eseguire il delete dell'oggetto fixture.

source: For each `TEST_F`, GoogleTest will create a **fresh** test fixture object, immediately call `SetUp()`, run the test body, call `TearDown()`, and then delete the test fixture object.
it_it: Per ciascun `TEST_F`, GoogleTest creerà un **nuovo** oggetto fixture, chiamerà immediatamente `SetUp()`, eseguirà il corpo del test, chiamerà `TearDown()` per poi eseguire il delete dell'oggetto fixture test.

source: For each call, would you like to see its actual argument values and which EXPECT_CALL gMock thinks it matches?
it_it: Per ogni chiamata, si potrebbero vedere i valori effettivi degli argomenti e a quale EXPECT_CALL gMock crede che corrisponda [match]?

source: For each call, would you like to see its actual argument values and which `EXPECT_CALL` gMock thinks it matches?
it_it: Per ogni chiamata, si potrebbero vedere i valori effettivi degli argomenti e a quale `EXPECT_CALL` gMock crede che corrisponda [match]?

source: For each test defined with TEST_F(), GoogleTest will create a fresh test fixture at runtime, immediately initialize it via SetUp(), run the test, clean up by calling TearDown(), and then delete the test fixture.
it_it: Per ogni test definito con TEST_F(), GoogleTest creerà una nuova fixture a runtime, lo inizializzerà immediatamente tramite SetUp(), esegue il test, ripulisce chiamando TearDown() ed esegue il delete della fixture di test.

source: For each test defined with `TEST_F()`, GoogleTest will create a *fresh* test fixture at runtime, immediately initialize it via `SetUp()`, run the test, clean up by calling `TearDown()`, and then delete the test fixture.
it_it: Per ogni test definito con `TEST_F()`, GoogleTest creerà una *nuova* fixture a runtime, lo inizializzerà immediatamente tramite `SetUp()`, esegue il test, ripulisce chiamando `TearDown()` ed esegue il delete della fixture di test.

source: For every new unit test, the framework creates a new test fixture.
it_it: Per ogni nuova unit test, il framework crea una nuova fixture.

source: For example, Pointee(Pointee(Lt(3))) matches a pointer that points to a pointer that points to a number less than 3 (what a mouthful...).
it_it: Per esempio, Pointee(Pointee(Lt(3))) è il match di un puntatore che punta a un puntatore che punta a un numero inferiore a 3 (che salti...).

source: For example, if all these implementations have a public default constructor (such that you can write new TypeParam), or if their factory functions have the same form (e.g. CreateInstance<TypeParam>()).
it_it: Ad esempio, se tutte queste implementazioni hanno un costruttore pubblico di default (in modo che sia possibile scrivere new TypeParam), o se le loro funzioni factory hanno la stessa forma (ad esempio CreateInstance<TypeParam>()).

source: For example, if the 4-th argument of the mock function is an int and my_action takes a double, WithArg<4>(my_action) will work.
it_it: Ad esempio, se il quarto argomento della funzione mock è un int e my_action accetta un double, WithArg<4>(my_action) funzionerà.

source: For example, to compare two Foo containers where Foo doesn't support operator==, one might write:
it_it: Ad esempio, per confrontare due contenitori Foo dove Foo non supporta operator==, si potrebbe scrivere:

source: For example, you can probably guess that
it_it: Ad esempio, probabilmente si intuirà che

source: For example, you may want to make sure the Set() and Clear() calls are right next to the code that uses your mock.
it_it: Ad esempio, per assicurarsi che le chiamate Set() e Clear() siano proprio accanto al codice che utilizza il mock.

source: For example, IsDivisibleBy7() can be used to match any type where the value of (arg % 7) == 0 can be implicitly converted to a bool.
it_it: Ad esempio, IsDivisibleBy7() può essere utilizzato per corrispondere [match] a qualsiasi tipo in cui il valore di (arg % 7) == 0 può essere convertito implicitamente in un bool.

source: For example, EXPECT_THAT(some_bool, "some string") will compile and may pass unintentionally.
it_it: Per esempio, EXPECT_THAT(some_bool, "some string") verrà compilato e potrebbe passare involontariamente.

source: For example, --gtest_filter=* runs all tests while --gtest_filter=SquareRoot* runs only the SquareRootTest tests.
it_it: Ad esempio, --gtest_filter=* esegue tutti i test mentre --gtest_filter=SquareRoot* esegue solo i test SquareRootTest.

source: For example, ASSERT_FLOAT_EQ (2.00001, 2.000011) passes—Google does not throw an error if the results tally up to four decimal places.
it_it: Ad esempio, ASSERT_FLOAT_EQ (2.00001, 2.000011) passa: Google non genera un errore se i risultati raggiungono fino a quattro cifre decimali.

source: For example, `EXPECT_THAT(some_bool, "some string")` will compile and may pass unintentionally.
it_it: Per esempio, `EXPECT_THAT(some_bool, "some string")` verrà compilato e potrebbe passare involontariamente.

source: For example, `IsDivisibleBy7()` can be used to match any type where the value of `(arg % 7) == 0` can be implicitly converted to a `bool`.
it_it: Ad esempio, `IsDivisibleBy7()` può essere utilizzato per corrispondere [match] a qualsiasi tipo in cui il valore di `(arg % 7) == 0` può essere convertito implicitamente in un `bool`.

source: For example, `Pointee(Pointee(Lt(3)))` matches a pointer that points to a pointer that points to a number less than 3 (what a mouthful...).
it_it: Per esempio, `Pointee(Pointee(Lt(3)))` corrisponde a un puntatore che punta a un puntatore che punta a un numero inferiore a 3 (che salti...).

source: For example, a better definition of IsDivisibleBy7 is:
it_it: Ad esempio, una definizione migliore di IsDivisibleBy7 è:

source: For example, a better definition of `IsDivisibleBy7` is:
it_it: Ad esempio, una definizione migliore di `IsDivisibleBy7` è:

source: For example, despite the tricks shown in the previous recipes, they don't let you directly specify the types of the mock function arguments and the action parameters, which in general leads to unoptimized compiler error messages that can baffle unfamiliar users.
it_it: Ad esempio, nonostante i trucchi mostrati nelle ricette precedenti, non consentono di specificare direttamente i tipi degli argomenti della funzione mock e dei parametri dell'azione, il che in generale porta a messaggi di errore del compilatore non ottimizzati che possono confondere gli utenti non esperti.

source: For example, for a Boolean function IsPositive() overloaded to take either a single int or double argument, it would be necessary to write one of the following:
it_it: Ad esempio, per l'overload di una funzione booleana IsPositive() per accettare un singolo argomento int o double, sarebbe necessario scrivere uno dei seguenti:

source: For example, for a Boolean function `IsPositive()` overloaded to take either a single `int` or `double` argument, it would be necessary to write one of the following:
it_it: Ad esempio, per l'overload di una funzione booleana `IsPositive()` per accettare un singolo argomento `int` o `double`, sarebbe necessario scrivere uno dei seguenti:

source: For example, given
it_it: Per esempio, dato

source: For example, given the test program:
it_it: Ad esempio, dato il programma di test:

source: For example, given:
it_it: Ad esempio, dato:

source: For example, here's a predicate that's satisfied by any number that is >= 0, <= 100, and != 50:
it_it: Per esempio, ecco un predicato soddisfatto da qualsiasi numero >= 0, <= 100 e != 50:

source: For example, if the arguments match the matchers in the second EXPECT_CALL(), but not those in the first and third, then the second expectation will be used.
it_it: Ad esempio, se gli argomenti corrispondono ai matcher nella seconda EXPECT_CALL(), ma non a quelli nella prima o nella terza, allora verrà utilizzata la seconda expectation.

source: For example, if all these implementations have a public default constructor (such that you can write `new TypeParam`), or if their factory functions have the same form (e.g. `CreateInstance<TypeParam>()`).
it_it: Ad esempio, se tutte queste implementazioni hanno un costruttore pubblico di default (in modo che sia possibile scrivere `new TypeParam`), o se le loro funzioni factory hanno la stessa forma (ad esempio `CreateInstance<TypeParam>()`).

source: For example, if the 4-th argument of the mock function is an `int` and `my_action` takes a `double`, `WithArg<4>(my_action)` will work.
it_it: Ad esempio, se il quarto argomento della funzione mock è un `int` e `my_action` accetta un `double`, `WithArg<4>(my_action)` funzionerà.

source: For example, if the above assertion on value1 fails, the resulting message will be similar to the following:
it_it: Ad esempio, se l'asserzione precedente su value1 fallisce, il messaggio risultante sarà simile al seguente:

source: For example, if the above assertion on `value1` fails, the resulting message will be similar to the following:
it_it: Ad esempio, se l'asserzione precedente su `value1` fallisce, il messaggio risultante sarà simile al seguente:

source: For example, if the arguments match the matchers in the second `EXPECT_CALL()`, but not those in the first and third, then the second expectation will be used.
it_it: Ad esempio, se gli argomenti corrispondono ai matcher nella seconda `EXPECT_CALL()`, ma non a quelli nella prima o nella terza, allora verrà utilizzata la seconda expectation.

source: For example, if the class definition looks like the following:
it_it: Ad esempio, se la definizione della classe è simile alla seguente:

source: For example, if the code to be tested looks like:
it_it: Ad esempio, se il codice da testare è simile a:

source: For example, if you are exercising the code:
it_it: Ad esempio, per testare il codice:

source: For example, if you are trying to measure the time/memory footprint of a test, you need to put some test-specific code in place to measure those values.
it_it: Ad esempio, per cercare di misurare tempo e memoria impiegati in un test, si deve inserire del codice specifico per il test per misurare tali valori.

source: For example, if you define `IsEven()` as:
it_it: Per esempio, se si definisce `IsEven()` come:

source: For example, if you want to use the action in functions with different types (e.g. like Return() and SetArgPointee()).
it_it: Ad esempio, per utilizzare l'azione in funzioni con tipi diversi (ad esempio come Return() e SetArgPointee()).

source: For example, if you want to use the action in functions with *different* types (e.g. like `Return()` and `SetArgPointee()`).
it_it: Ad esempio, per utilizzare l'azione in funzioni con tipi *diversi* (ad esempio come `Return()` e `SetArgPointee()`).

source: For example, in
it_it: Ad esempio, in

source: For example, in Listing 3, it would be good to receive an error message when doing square-root (-22.0) and exiting the program with return status -1 instead of returning -1.0.
it_it: Ad esempio, nel Lisato 3, sarebbe utile ricevere un messaggio di errore quando si esegue square-root (-22.0) e si esce dal programma con lo stato restituito -1 invece di restituire -1.0.

source: For example, in some tests we may not care about how many times GetX() and GetY() get called.
it_it: Ad esempio, in alcuni test potremmo non interessarci a quante volte GetX() e GetY() vengono chiamate.

source: For example, in some tests we may not care about how many times `GetX()` and `GetY()` get called.
it_it: Ad esempio, in alcuni test potremmo non interessarci a quante volte `GetX()` e `GetY()` vengono chiamate.

source: For example, in the body of MATCHER_P(HasAbsoluteValue, value) above, you can write value_type to refer to the type of value.
it_it: Ad esempio, nel corpo di MATCHER_P(HasAbsoluteValue, value) sopra, si può scrivere value_type per fare riferimento al tipo di value.

source: For example, in the body of ACTION_P(Add, n) above, you can write n_type for the type of n.
it_it: Ad esempio, nel corpo di ACTION_P(Add, n) sopra, si può scrivere n_type per il tipo di n.

source: For example, in the body of `ACTION_P(Add, n)` above, you can write `n_type` for the type of `n`.
it_it: Ad esempio, nel corpo di `ACTION_P(Add, n)` sopra, si può scrivere `n_type` per il tipo di `n`.

source: For example, in the body of `MATCHER_P(HasAbsoluteValue, value)` above, you can write `value_type` to refer to the type of `value`.
it_it: Ad esempio, nel corpo di `MATCHER_P(HasAbsoluteValue, value)` sopra, si può scrivere `value_type` per fare riferimento al tipo di `value`.

source: For example, it may change some global state or modify an output argument.
it_it: Ad esempio, potrebbe modificare alcuni stati globali o modificare un argomento di output.

source: For example, let's take a simple integer function:
it_it: Ad esempio, prendiamo una semplice funzione intera:

source: For example, statically-initialized modules may start threads before main is ever reached.
it_it: Ad esempio, i moduli inizializzati staticamente possono avviare i thread prima che venga raggiunto il main.

source: For example, the test
it_it: Per esempio, il test

source: For example, the following code generates a test failure on the mock my_mock of type MockClass if a method other than DoSomething() is called:
it_it: Ad esempio, il codice seguente genera il fallimento del test sul mock my_mock di tipo MockClass se viene chiamato un metodo diverso da DoSomething():

source: For example, the following code generates a test failure on the mock `my_mock` of type `MockClass` if a method other than `DoSomething()` is called:
it_it: Ad esempio, il codice seguente genera il fallimento del test sul mock `my_mock` di tipo `MockClass` se viene chiamato un metodo diverso da `DoSomething()`:

source: For example, the following code generates warnings on the mock my_mock of type MockClass if a method other than DoSomething() is called:
it_it: Ad esempio, il codice seguente genera i warning sul mock my_mock di tipo MockClass se viene chiamato un metodo diverso da DoSomething():

source: For example, the following code generates warnings on the mock `my_mock` of type `MockClass` if a method other than `DoSomething()` is called:
it_it: Ad esempio, il codice seguente genera i warning sul mock `my_mock` di tipo `MockClass` se viene chiamato un metodo diverso da `DoSomething()`:

source: For example, the following code sets the default behavior when my_mock.SetPosition() is called with any two arguments, the first argument being less than the second:
it_it: Ad esempio, il codice seguente imposta il comportamento di default quando my_mock.SetPosition() venga chiamata con due argomenti qualsiasi, col primo argomento minore del secondo:

source: For example, the following code sets the default behavior when `my_mock.SetPosition()` is called with any two arguments, the first argument being less than the second:
it_it: Ad esempio, il codice seguente imposta il comportamento di default quando `my_mock.SetPosition()` venga chiamata con due argomenti qualsiasi, col primo argomento minore del secondo:

source: For example, the following code sets the expectation that my_mock.SetPosition() is called with any two arguments, the first argument being less than the second:
it_it: Ad esempio, il codice seguente imposta la expectation che my_mock.SetPosition() venga chiamata con due argomenti qualsiasi, col primo argomento minore del secondo:

source: For example, the following code sets the expectation that `my_mock.SetPosition()` is called with any two arguments, the first argument being less than the second:
it_it: Ad esempio, il codice seguente imposta la expectation che `my_mock.SetPosition()` venga chiamata con due argomenti qualsiasi, col primo argomento minore del secondo:

source: For example, the following code sets the expectation that the Describe() method of my_mock is called only after both InitX() and InitY() have been called.
it_it: Ad esempio, il codice seguente imposta la expectation che il metodo Describe() di my_mock venga chiamato dopo che sia InitX() che InitY() siano stati chiamati.

source: For example, the following code sets the expectation that the Reset() method of my_mock is called before both GetSize() and Describe(), and GetSize() and Describe() can occur in any order relative to each other:
it_it: Ad esempio, il codice seguente imposta la expectation che il metodo Reset() di my_mock venga chiamato prima sia di GetSize() che di Describe() e GetSize() e Describe() possono verificarsi in qualsiasi ordine relativo l'uno rispetto all'altro:
